In [ ]:
#Задача 1

In [2]:
import pandas as pd

In [3]:
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [4]:
movies = pd.read_csv('movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [5]:
top_rating = ratings.query('rating == 5.0')
the_one = top_rating.groupby('movieId').count().filter(items = ['userId']).sort_values('userId', ascending=False).head(1)
the_one

         userId
movieId
318         153

In [6]:
the_one.merge(movies, how = 'left', left_on = 'movieId', right_on = 'movieId').filter(items = ['movieId', 'title'])

   movieId                             title
0      318  Shawshank Redemption, The (1994)

In [7]:
#Задача 2

In [8]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [9]:
power_pribalt = power.query('country.str.contains("Estonia") or country.str.contains("Latvia") or country.str.contains("Lithuania")')
power_pribalt.query('year >= 2005 and year <= 2010 and category in (4, 12, 21) and quantity > 0').filter(items = ['country', 'quantity']).groupby('country').sum()

           quantity
country
Estonia     63440.0
Latvia      54844.0
Lithuania  122296.0

In [10]:
df = pd.read_html('https://fortrader.org/quotes')

In [11]:
#Как пример
df[0]

                               Type   Last   Chg.  Chg.%  Time
0  Нефть (BRENT) Курс нефти сегодня  62.58  0.710  1.150   NaN
1   Нефть (WTI) Цены на нефть (WTI)  57.38  0.740  1.310   NaN
2          Сахар котировки на сахар  12.63  0.000  0.000   NaN
3                   Газ Цена на газ   2.78 -0.007 -0.251   NaN